Revit 2027 API
DirectShapeLibrary.AddDefinition Method
Overload List
Name | Description
AddDefinition(String, GeometryObject) |  Add a definition to be reused by instances. A definition is a single geometry object.
AddDefinition(String, IList<GeometryObject>) |  Add a definition to be reused by instances. A definition is a collection of geometry objects.
Top
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace